Updated docker-publish.yml and README.md
